nc: 80  # number of classes

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  #  0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 #  1  P2/4
  - [-1, 2, C3k2_EMBC, [256, False, 0.25]]     #  2  P3/8
  - [-1, 1, Conv, [256, 3, 2]]                 #  3
  - [-1, 2, C3k2_EMBC, [512, False, 0.25]]     #  4  P4/16
  - [-1, 1, Conv, [512, 3, 2]]                 #  5
  - [-1, 2, C3k2_EMBC, [512, True]]            #  6  P5/32
  - [-1, 1, Conv, [1024, 3, 2]]                #  7
  - [-1, 1, SPPF, [1024, 5]]                   #  8
  - [-1, 2, C2PSA, [1024]]                     #  9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]]                  # 11  (P5->P4)
  - [-1, 2, C3k2_EMBC, [512, False]]           # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 4], 1, Concat, [1]]                  # 14  (P4->P3)
  - [-1, 2, C3k2_EMBC, [256, False]]           # 15  P3/8 (small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 16
  - [[-1, 12], 1, Concat, [1]]                 # 17  (P3->P4)
  - [-1, 2, C3k2_EMBC, [512, False]]           # 18  P4/16 (medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 19
  - [[-1, 9], 1, Concat, [1]]                  # 20  (P4->P5)
  - [-1, 2, C3k2_EMSCP, [1024, True]]          # 21  P5/32 (large)

  - [[15, 18, 21], 1, Detect, [80]]            # 22  Detect(P3, P4, P5)