nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0
  - [-1, 1, Conv, [128, 3, 2]]             # 1
  - [-1, 1, C3k2_EMBC, [256, False, 0.25]] # 2
  - [-1, 1, C3k2_EMBC, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 2]]             # 4
  - [-1, 1, C3k2_EMBC, [512, False, 0.25]] # 5
  - [-1, 1, C3k2_EMBC, [512, False, 0.25]] # 6
  - [-1, 1, Conv, [512, 3, 2]]             # 7
  - [-1, 1, C3k2_EMBC, [512, True]]        # 8
  - [-1, 1, C3k2_EMBC, [512, True]]        # 9
  - [-1, 1, Conv, [1024, 3, 2]]            # 10
  - [-1, 1, C3k2_EMSCP, [1024, True]]      # 11
  - [-1, 1, C3k2_EMSCP, [1024, True]]      # 12
  - [-1, 1, SPPF, [1024, 5]]               # 13
  - [-1, 1, C2PSA, [1024]]                 # 14
  - [-1, 1, C2PSA, [1024]]                 # 15
  - [-1, 1, MPCA, [1024]]                  # 16

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 8], 1, Concat, [1]]              # 18
  - [-1, 1, C3k2_EMBC, [512, False]]       # 19
  - [-1, 1, C3k2_EMBC, [512, False]]       # 20

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21
  - [[-1, 5], 1, Concat, [1]]              # 22
  - [-1, 1, C3k2_EMBC, [256, False]]       # 23
  - [-1, 1, C3k2_EMBC, [256, False]]       # 24
  - [-1, 1, ELA, [256]]                    # 25

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 20], 1, Concat, [1]]             # 27
  - [-1, 1, C3k2_EMBC, [512, False]]       # 28
  - [-1, 1, C3k2_EMBC, [512, False]]       # 29
  - [-1, 1, ELA, [512]]                    # 30

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]             # 32
  - [-1, 1, C3k2_EMSCP, [1024, True]]      # 33
  - [-1, 1, C3k2_EMSCP, [1024, True]]      # 34
  - [-1, 1, ELA, [1024]]                   # 35

  - [[24, 29, 34], 1, Detect, [80]]        # 36